# level_data.py
LEVELS = [
    {   # --- Stage 1 ---
        "player_start": (100, 700),
        "platforms": [
            (0, 820, 1600, 80),
            (300, 700, 150, 30),
            (600, 580, 150, 30),
            (900, 460, 150, 30),
            (1200, 340, 150, 30),
            (1350, 660, 100, 160, None, "door.png"),  # ← 문, 짙은 갈색
        ],
        "trap_type": "fall",
        "trap_platform": (1200, 340, 150, 30),

        # ─ 낙하물 시작 위치(머리 위) ─
        #   x는 “플레이어 중심 x”로 대체할 것이므로 y만 주어도 OK
        "trap_spawn_y": 50,     # 화면 윗부분에서 떨어지게
        "trap_width":  60,
        "trap_height": 60,   # 낙하물 생성 위치(x, y)

        "spike_trigger_rect": (1350, 790, 100, 820),   # (x1, y1, x2, y2)
        "spike_spawn_x": 1400,     # 가운데쯤
        "spike_ground_y": 820,    # 땅 y (플랫폼 top과 맞추면 됨)
    },
    {   # --- Stage 2 ---
        "player_start": (100, 700),
        "platforms": [
            # 기본 땅 
            (0, 760, 300, 140),   # 왼쪽 땅
            (500, 760, 200, 140),     # 가운데 땅
            (1400, 760, 200, 140),    # 오른쪽 땅
            (1100, 660, 200, 20),      # 공중 발판2
            (900, 760, 100, 20,(135, 206, 250), None, True) #투명발판
        ],
        
        "falling_platforms": [
            (750, 660, 150, 20),      # 공중 발판1
        ],
        
        # 첫번째 장애물
        "trap_type": "fall",
        "trap_platform": (300, 700, 150, 30),  # 구덩이 직전 진입하면 발동
        "trap_spawn_y": 300,
        "trap_width": 60,
        "trap_height": 60,
        "trap_x_offset": 100,

        # 세번째 장애물
        "spike_trigger_rect": (1350, 660, 100, 100),   
        "spike_spawn_x": 1400,                         # 뱀이 이 x 좌표에서 튀어나오고
        "spike_ground_y": 760                          # y 기준은 땅
    },

    {   # --- Stage 3 ---
        "player_start": (120, 700),
        "platforms": [
            (100, 820, 100, 80),     # 왼쪽 지면
            (1350, 820, 150, 80),    # 오른쪽 지면
            (300, 700, 150, 30),     # 발판 1
            (600, 580, 150, 30),     # 발판 2
            (900, 460, 150, 30),     # 발판 3
            (1200, 340, 150, 30),    # 발판 4
        ],
        
        # ▼ 폭탄 떨어지는 트랩 추가
        "trap_type": "fall",
        "trap_platform": (350, 650, 150, 30),   # 첫 번째 발판 밟으면 발동
        "trap_spawn_y": 300,                    # 폭탄이 떨어질 높이
        "trap_width":  60,
        "trap_height": 60,
        "trap_x_offset": 100,                   # 플레이어 중심보다 살짝 오른쪽에 떨어지도록
    }
]
